###  Part # 1
  #### Terraform Initialization `success`
  #### Terraform Plan `success`
  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.smtp-user will be created
  + resource "aws_iam_access_key" "smtp-user" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "smtp-user"
    }

  # aws_iam_policy.ses-sender-policy will be created
  + resource "aws_iam_policy" "ses-sender-policy" {
      + arn         = (known after apply)
      + description = "Allows sending of e-mails via Simple Email Service"
      + id          = (known after apply)
      + name        = "ses-sender"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ses:SendRawEmail"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Env" = "prd"
        }
    }

  # aws_iam_user.smtp-user will be created
  + resource "aws_iam_user" "smtp-user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "smtp-user"
      + path          = "/"
      + tags_all      = {
          + "Env" = "prd"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.smtp-iam-user-attachment will be created
  + resource "aws_iam_user_policy_attachment" "smtp-iam-user-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "smtp-user"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + smtp-username = (known after apply)
  + smtp_password = (sensitive value)

  ```
  *Pusher: @iMichka, Action: `pull_request`, Workflow: `Production`*